package messages

import "github.com/93mmm/burger-tg-bot.git/internal/domain/definitions"

var (
	equalsMessages = map[string]definitions.Message{
		"господизаберименяотсюда": &definitions.TextMessage{
			Text: "Хлопчик, остуди свою жепу, услышал тебя родной",
		},
		"видишь": &definitions.TextMessage{
			Text: "А как на счет FUCK PARENTS?",
		},
		"чизбургерсбеконом": &definitions.TextMessage{
			Text: "посмотрите на этот чизбургер с беконом из паба оу господи там что ещё и картошка фри оох о господи иисусе забери меня прямо сейчас господи забери меня прямо сейчас охх ёмаё ох мы поставим это на первое место потому что эта девчонка выглядит просто сногшибательно оу ооу оуу а-се-а-го ранс оуу чёрт мм мгм мы поставим это на третье место господи как же аппетитно выглядит этот бекон о мой грёбаный иисус ох господи ахрененная запечённая картошка господи дайте мне всё три блин ну-ка посмотрим мы поставим это на четвёртое место ухх 🤤\n\n\nпосмотрите на этот чизбургер с беконом из паба \nоу господи там что ещё и картошка фри \nоох о господи иисусе забери меня прямо сейчас господи забери меня прямо сейчас \nохх ёмаё ох мы поставим это на первое место потому что эта девчонка выглядит просто сногшибательно \nоу ооу оуу а-се-а-го ранс оуу чёрт мм мгм \nмы поставим это на третье место \nгосподи как же аппетитно выглядит этот бекон \nо мой грёбаный иисус \nох господи ахрененная запечённая картошка \nгосподи дайте мне всё три\nблин ну-ка посмотрим мы поставим это на четвёртое место \nухх 🤤",
		},
		"бэргер": &definitions.TextMessage{
			Text: "посмотрите на этот чизбургер с беконом из паба оу господи там что ещё и картошка фри оох о господи иисусе забери меня прямо сейчас господи забери меня прямо сейчас охх ёмаё ох мы поставим это на первое место потому что эта девчонка выглядит просто сногшибательно оу ооу оуу а-се-а-го ранс оуу чёрт мм мгм мы поставим это на третье место господи как же аппетитно выглядит этот бекон о мой грёбаный иисус ох господи ахрененная запечённая картошка господи дайте мне всё три блин ну-ка посмотрим мы поставим это на четвёртое место ухх 🤤\n\n\nпосмотрите на этот чизбургер с беконом из паба \nоу господи там что ещё и картошка фри \nоох о господи иисусе забери меня прямо сейчас господи забери меня прямо сейчас \nохх ёмаё ох мы поставим это на первое место потому что эта девчонка выглядит просто сногшибательно \nоу ооу оуу а-се-а-го ранс оуу чёрт мм мгм \nмы поставим это на третье место \nгосподи как же аппетитно выглядит этот бекон \nо мой грёбаный иисус \nох господи ахрененная запечённая картошка \nгосподи дайте мне всё три\nблин ну-ка посмотрим мы поставим это на четвёртое место \nухх 🤤",
		},
		"обед": &definitions.TextMessage{
			Text: "Приятного аппетита",
		},
		"накидайте": &definitions.TextMessage{
			Text: "Накидайте за обе щеки бедолаге, благословлю",
		},
	}

	containsMessages = map[string]definitions.Message{
		"бургер": &definitions.TextMessage{
			Text: "господи закажи меня прямо сейчас",
		},
		"https://git.mos.ru/buch-cloud/moscow-team-2.0": &definitions.TextMessage{
			Text: "накидайте ему аппрувов",
		},
		"дейли": &definitions.TextMessage{
			Text: "https://telemost.yandex.ru/j/24504696564321",
		},
		"дэйли": &definitions.TextMessage{
			Text: "https://telemost.yandex.ru/j/24504696564321",
		},
		// "ДИТ": &definitions.Gif{
		// 	FileID: ,
		// }
	}
)
